Autodesk.Revit.DB.Architecture.StairsEndConnectionType
The join style between a run and landing.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsEndConnectionType.Notch
The run and landing are joined by a notch.

Autodesk.Revit.DB.Architecture.StairsEndConnectionType.StraightCut
The run and landing are joined by a straight cut.